Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: སྙམ་ནས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ནས་མི་སྣང་བར་གྱུར་ཏེ། མཉན་དུ་ཡོད་པའི་ཕྱོགས་གང་ན་ཝ་འདུག་པའི་ཕྱོགས་དེའི་སྟེང་གི་བར་སྣང་ལ་ལྷའི་གཞལ་མེད་ཁང་དང་བཅས་པར་འཁོད་དེ།
en: With this thought, they disappeared from the garden of Prince Jeta and traveled to the area of Śrāvastī where Jackal was. They stayed in the sky above the region in an immense celestial mansion,

source: མཉན་དུ་ཡོད་པ་ཐོག་ཐག་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་སོ། །
en: and the entire region of Śrāvastī was filled with a bright light.

source: དེ་ནས་ཝས་ལྷ་ལྔ་བརྒྱ་པོ་དེ་དག་མཐོང་ངོ་། །
en: Young Jackal saw the five hundred gods

source: མཐོང་ནས་ཀྱང་ཁྱེད་སུ་དག་ཅི་བྱེད་ཅེས་བྱས་སོ། །
en: and asked, “Who are you?”

source: དེ་དག་གིས་སྨྲས་པ། བདག་ཅག་ནི་སྔོན་ཁྱོད་ཀྱི་གྲོགས་པོ་དེ་དག་ཡིན་ནོ། །
en: “We’re your former friends,” they replied.

source: ཁྱེའུས་སྨྲས་པ། སྔོན་ནི་ངས་ཁྱེད་རྣམས་ཚུལ་དེ་ལྟ་མ་ཡིན་པར་མཐོང་ལ། ད་ནི་ཚུལ་དེ་ལྟ་མ་ཡིན་པར་མཐོང་ངོ་ཞེས་བྱས་སོ། །
en: “I’ve never before seen you in this kind of dress,” said the young man.

source: དེ་དག་གིས་སྨྲས་པ། བདག་ཅག་ནི་གནས་འདི་ནས་ཤི་འཕོས་ཏེ་ལྷའི་ནང་དུ་སྐྱེས་སོ། །
en: “We have died from this place and taken birth among the gods,” they explained.

source: ཝས་སྨྲས་པ། ཁྱེད་བརྟུལ་ཞུགས་ཡི་དམ་དུ་བླངས་པ་དེ་ཁོ་ནས་ལྷའི་ནང་དུ་སྐྱེས་སམ།
en: “You took a vow of yogic discipline, and that was enough for you to take birth among the gods?” Jackal said.

source: དེ་དག་གིས་སྨྲས་པ། བརྟུལ་ཞུགས་ཡི་དམ་དུ་བླངས་པ་དེས་སྐྱེས་པ་མ་ཡིན་གྱི་སྔོན་ངས་མི་དགེ་བའི་ལས་ཀྱིས་ཡི་དགས་སུ་སྐྱེས་པ་ལས།
en: “It was not because we took vows of yogic discipline,” they told him. “Due to our previous misdeeds we had taken birth as anguished spirits.

source: ངེད་ཀྱིས་འཕགས་པ་ཤཱ་རིའི་བུ་ལས་བརྟེན་ནས་ཡི་དགས་ཀྱི་སྐྱེ་གནས་དང་བྲལ་ཏེ་ལྷའི་སྐྱེ་གནས་ཐོབ་པར་གྱུར་ཏོ། །
en: But by entrusting ourselves to Noble Śāriputra, we were freed from rebirth as anguished spirits and took rebirth as gods.

source: ཁྱོད་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་སོང་ཤིག་དང་ཁྱོད་ཀྱང་སྡུག་བསྔལ་འདི་ལས་ཐར་བར་འགྱུར་ཡང་སྲིད་དོ་ཞེས་བྱས་ནས་
en: Take refuge in the Blessed Buddha, and perhaps you too will be freed from suffering.”

source: ལྷ་དེ་དག་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: After they said that, the gods all disappeared.

source: འོད་སྲུང་རྫོགས་བྱེད་ཀྱིས་ཀྱང་ལྷ་ལྔ་བརྒྱ་པོ་དེ་དག་ཝའི་ཐད་དུ་སོང་བ་མཐོང་ནས་གཞན་དག་ལ་བསྙད་དེ།
en: Pūraṇa Kāśyapa saw the five hundred gods go to see Jackal, and he told the others,

source: འདི་ལྟར་འདི་ལ་ལྷ་རྣམས་ཀྱང་ལུས་སྟོན་པར་བྱེད་ཅིང་འོང་བ་ལས་ན།
en: “Just like that, the gods even showed him their bodies and then departed.

source: བདག་ཉིད་ཆེན་པོ་འདིས་ནི་བརྟུལ་ཞུགས་གྲུབ་པར་གྱུར་ཏོ་ཞེས་ཟེར་རོ། །
en: This great soul has accomplished his vow!”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་སེམས་ཅན་མང་པོ་དག་གིས་ཕྱི་ས་བཟའ་བར་ཡི་དམ་བླངས་སོ། །
en: No sooner had they heard this than many of those beings took vows to eat excrement.

source: ཁྱེའུ་ཝས་ནི་ལྷ་རྣམས་ཀྱི་ཚིག་ཐོས་ནས་བསམས་པ།
en: After young Jackal heard the gods’ words he thought,

source: འོན་ཀྱང་བདག་གི་ལུས་འདི་ཁོ་ན་ལྟར་ཕྱི་སས་ཡོག་བཞིན་དུ། བཅོམ་ལྡན་འདས་ལ་ལྟར་འགྲོ་བ་ནི་མི་ཕོད་དོ་སྙམ་སྟེ།
en: “I should go see the Blessed Buddha and offer him my respect, but I can’t bear to see the Blessed One with my body covered in excrement like this.”

source: ཆུ་ཀླུང་ཁང་ལྡན་གྱི་འགྲམ་དུ་སོང་ནས་ལུས་ཐམས་ཅད་སས་དྲུད་དེ་ཁྲུས་བྱས་ནས།
en: So he went to the banks of the Ajiravatī River, scoured his whole body with earth, washed himself, and then went to see the Blessed One.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ངོ་། །
en: Young Jackal saw the Blessed One.

source: དེ་ནས་ཁྱེའུ་ཝས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ། མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ། མེ་ལྕེ་མར་གྱིས་བཏབ་པ་ལྟ་བུ། མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ་མཆོད་སྡོང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟ་བུ་བློ་གསལ་ཞིང་དྲི་མ་མེད་ལ། རྣམ་པར་དག་པ་དང་ལྡན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: His body, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire, like flames stoked with ghee, like a lamp set in a golden vessel, and like a pillar adorned with all manner of jewels. He was immaculate, clear-minded, and pure of heart.

source: མཐོང་ནས་ཀྱང་མཆོག་ཏུ་དགའ་བ་སྐྱེས་ཏེ། དགེ་བའི་རྩ་བ་བསགས་པའི་རྒྱུ་ལས་བྱུང་བའི་སེམས་ཅན་གྱིས། དང་པོ་སངས་རྒྱས་མཐོང་བའི་ཉམས་བདེ་བ་ཅི་འདྲ་བ་དེ་ལྟ་བུ་ནི། ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་ཞི་གནས་ཀྱི་སེམས་ལ་གོམས་པར་བྱས་པ་ལ་ཡང་ཉམས་བདེ་བ་དེ་ལྟ་བུ་སྐྱེ་བར་མི་འགྱུར་རོ། །
en: When he saw the Blessed Buddha the sight of him filled him with supreme joy, for beings who have gathered the roots of virtue to see a buddha for the first time experience such rapture as is not to be had even by those who practice calm abiding meditation for twelve years.

source: དེ་ལྟར་མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འདུག་གོ། །
en: Full of such joy he approached the Blessed One, touched his head to the Blessed One’s feet, and sat before him to listen to the Dharma.

source: དེ་ནས་ཁྱེའུ་ཝས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ། འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ
en: When he heard it, young Jackal destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of non-return right where he sat.

source: བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Lord, if permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ། བསྙེན་པར་རྫོགས་པར་མཛད་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: With the words “Come, join me, monk! Practice the holy life,” the Blessed One led him to go forth as a novice, conferred on him full ordination, and instructed him.

source: རིག་པ་དང་མངོན་པར་ཤེས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་མི་ལྟ་བ།
en: He achieved the insights, superknowledges, and discriminations. He had no regard for worldly profit, passion, or acclaim.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་ཝས་ལས་ཅི་བགྱིས་ཤིང་བསགས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ། བཙས་མ་ཐག་ཏུ་ལུས་ཐམས་ཅད་ནས་ཕྱི་སའི་དྲི་འབྱུང་བ་དང་ཕྱི་ས་འཚལ་བ་དང་ཕྱི་སའི་འདམ་དུ་གནས་པར་གྱུར་ལགས།
en: “Lord,” the monks asked the Blessed Buddha, “what action did Jackal take that ripened into his birth into a family of great means, prosperity, and wealth, and that as soon as he was born, the smell of excrement arose from all over his body, he desired excrement, and he lived in excrement?

source: ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས། འདིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: What action did he take that ripened such that he pleased the Blessed One, did not displease him, went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་ཉིད་ཀྱིས་ལས་དེ་ལྟ་བུ་བྱས་ཤིང་བསགས་ཏེ
en: “Monks,” the Blessed One explained, “such are the actions that he committed and accumulated:

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks, in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་ཚེ་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན། ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ། ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་ལས།
en: there lived in Vārāṇasī a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཕྱི་ཞིག་ན་དེ་སངས་རྒྱས་ལ་དགའ་བ་དང་ཆོས་ལ་དགའ་བ་དང་དགེ་འདུན་ལ་དགའ་བར་གྱུར་ནསསྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་ཏེ།
en: “In admiration for the Buddha, in admiration for the Dharma, and in admiration for the Saṅgha, he went for refuge and took the fundamental precepts.

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ནས་དེས་བསམས་པ།
en: Manifesting the resultant state of non-return, he thought,

source: བདག་ལ་བུ་ཡང་མེད་བུ་མོ་ཡང་མེད་པས་ཤི་སྟེ་དུས་ལས་འདས་པའི་འོག་ཏུ་བདག་ལ་ཅི་བདོག་པ་ཐམས་ཅད་རྒྱལ་པོ་དབང་བྱེད་པར་གྱུར་ན
en: ‘Seeing as I do not have a son or daughter, after I die all I have will become property of the king.

source: མ་ལ་བདག་གིས་སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་ལ་བཀུར་སྟི་བྱའོ་སྙམ་སྟེ།
en: I will show my respect to the Buddha, Dharma, and Saṅgha.’

source: དེས་རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་གཙུག་ལག་ཁང་བརྩིགས་ནས་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ཏེ། དགེ་སློང་རྣམས་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས་དེར་དགེ་སློང་ཞལ་ཏ་བ་ལ་བསྐོས་སོ། །
en: He built a monastery complete in every respect, provided the monks with everything they needed, and appointed a monk to act as steward.

source: དེ་ནས་ཕྱི་ཞིག་ན། ཞལ་ཏ་བ་དེ་ལྗོངས་སུ་བྱ་བ་ཞིག་ཡོད་དེ། ཁྱིམ་བདག་དེ་ལ་བཟླུགས་ནས་སོང་ངོ་། །
en: “Then one day the steward had something to do out in the countryside, and after making a request of the householder, he departed.

source: དེ་དེར་སོང་བའི་འོག་ཏུ་དགྲ་བཅོམ་པ་ཞིག་ལྗོངས་རྒྱུ་ཞིང་སོང་སོང་བ་ལས་གཙུག་ལག་ཁང་དེར་ཕྱིན་ཏེ།
en: After he had gone, an arhat, who had been traveling and traveling through the countryside, arrived at the monastery.

source: ཁྱིམ་བདག་དེས་དེ་མཛེས་ཤིང་གཡོག་འཁོར་མཛེས་པ་མཐོང་ནས། མཐོང་མ་ཐག་ཏུ་ཁྱིམ་བདག་དེ་དེ་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ།
en: The householder saw his elegance and the elegance of his attendants, and immediately admired him.

source: དགའ་བར་གྱུར་ནས་དེས་བསམས་པ།
en: In his admiration he thought,

source: གལ་ཏེ་བདག་གིས་འདི་གཅིག་པུ་སྤྱན་དྲངས་ན་ནི་གནང་བར་མི་འགྱུར་ན། མ་ལ་བདག་གིས་དེ་ཁོ་ནའི་ཕྱིར་དགེ་སློང་གི་དགེ་འདུན་ཁྱིམ་དུ་སྤྱན་དྲངས་ལ་བཤོས་གསོལ་ལོ་སྙམ་ནས་
en: ‘If I extend an invitation to him alone, he will not assent, so I will invite the entire saṅgha of monks to my house for food.’

source: དེའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་སྨྲས་པ།
en: He bowed down at his feet and said,

source: འཕགས་པ་ཁྱོད་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པར་སང་བདག་གི་ཁྱིམ་དུ་བཤོས་གསོལ་བར་ཅི་གནང་ཞེས་བྱས་སོ། །
en: ‘Noble one, please permit me to request you and the saṅgha of monks to take your food at my house tomorrow.’

source: གལ་ཏེ་བདག་གིས་ཁས་མ་བླངས་ན་ནི་དགེ་སློང་འདི་རྣམས་ཀྱི་རྙེད་པའི་བར་ཆད་དུ་ཡང་འགྱུར་ལ།
en: ‘If I don’t accept, it will not only be an obstacle to the benefit of these monks.

source: སྦྱིན་བདག་འདིའི་བསོད་ནམས་ཀྱི་བར་ཆད་དུ་ཡང་འགྱུར་རོ་
en: It will also be an obstacle to this patron’s merit.’

source: སྙམ་ནས་དེས་དེ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་། །
en: With this in mind, he assented by his silence.

source: དེ་ནས་ཁྱིམ་བདག་དེས་ཕྱི་དེ་ཉིན་དགེ་སློང་གི་དགེ་འདུན་གྱི་ཕྱིར། ཁྱིམ་དུ་ཆོ་ག་དང་ལྡན་པའི་ཁྲུས་དང་མལ་ཆ་དང་སྟན་བཤམས་ཏེ།
en: “The next day, the householder readied his house with ritual bathing implements, beds, and seats for the saṅgha of monks.

source: ཆུ་ར་བཅས་ནས་དགེ་སློང་རྣམས་ལ་སྤྱན་འདྲེན་བཏང་སྟེ། འཕགས་པ་རྣམས་གདུགས་ཚོད་དང་ཆོ་ག་དང་ལྡན་པའི་ཁྲུས་ལ་བབ་ན།
en: He prepared the water pitchers and then extended an invitation to the monks that said,

source: འཕགས་པ་རྣམས་ཀྱིས་ད་དེའི་དུས་ལ་བབ་པར་མཁྱེན་པར་མཛད་དུ་གསོལ་ཞེས་བསྐུལ་ཏོ། །
en: ‘Noble ones, noon is upon us and it is time for the baths.

source: དེ་ནས་དགེ་སློང་རྣམས་དེའི་ཁྱིམ་དུ་ལྷགས་ནས།
en: Know that the time has come, noble ones, and your presence is requested.’

source: ཁྱིམ་བདག་དེས་འདྲེག་མཁན་བཀུག་སྟེ། དགེ་སློང་ཐམས་ཅད་ཀྱི་སྐྲ་འདྲེག་ཏུ་བཅུག་ནས་ཆོ་ག་དང་ལྡན་པའི་ཁྲུས་ཀྱིས་ཁྲུས་བྱེད་དུ་བཅུག་སྟེ། རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་སོ། །
en: “As the monks arrived at his house, the householder called for a barber, had him cut all the monks’ hair, offered them a bath, and by his own hand contented them with many good, wholesome foods.

source: དགེ་སློང་ཞལ་ཏ་པ་དེ་ཡང་ལྗོངས་སུ་དོན་བསྒྲུབས་ནས། གཙུག་ལག་ཁང་དེར་ཕྱིར་འོངས་སོ། །
en: “When the steward monk had completed his work in the valley, he returned to the monastery.

source: དེ་ཕྱིར་འོངས་ནས། དེ་དགེ་སློང་དེ་དག་མི་སྣང་ན་གར་དོང་ཞེས་དྲིས་པ་དང་དེ་དག་གིས་སྨྲས་པ། ཁྱིམ་བདག་གིས་ཁྱིམ་དུ་སྤྱན་དྲངས་སོ། །
en: Not seeing the other monks upon his return, he asked, ‘Where did they go?’ and the answer came, ‘The householder invited them to his home.’

source: དེས་སྨྲས་པ། སུའི་ཕྱིར་སྤྱན་དྲངས།
en: “ ‘On whose behalf?’ he asked.

source: དེ་དག་གིས་སྨྲས་པ། དགེ་སློང་ཞིག་གསར་དུ་འོངས་པའི་ཕྱིར་སྤྱན་དྲངས་སོ། །
en: “ ‘He invited them on behalf of a new monk who just arrived,’ they replied.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་དེ་ཤས་ཆེར་མི་དགའ་བར་གྱུར་ཏེ།
en: “As soon as he heard this, he was very dismayed.

source: དེའི་བྱ་བ་ཐམས་ཅད་བྱེད་པ་ནི་ང་ཡིན་ན། དགེ་སློང་གསར་དུ་འོངས་པ་ཞིག་གི་ཕྱིར། དེས་དགེ་སློང་གི་དགེ་འདུན་སྤྱན་དྲངས་སོ་སྙམ་དུ་རིག་ནས་
en: ‘What is it he did, that on his behalf the entire saṅgha of monks received such an invitation?’ he thought.

source: ཁྲོས་ཏེ། ཁྱིམ་བདག་དེའི་ཁྱིམ་དུ་སོང་ངོ་། །
en: This made him irate, and he went to the householder’s home.

source: དེ་དེར་སོང་ནས་བལྟས་ན་ཁྱིམ་བདག་དེ་རང་ཉིད་དགྲ་བཅོམ་པ་དེ་ལ་གུས་པར་བསྙེན་བཀུར་བྱེད་པ་མཐོང་ངོ་། །
en: Upon his arrival he looked and saw the householder serving the arhat with devotion and respect,

source: དེ་ནས་དེ་ལྷག་པར་ཕྲག་དོག་གི་ཕྱིར་ཁྲོས་སོ། །
en: and his jealousy caused him to become even more irate.

source: དེར་དགེ་སློང་རྣམས་བཤོས་གསོལ་ནས། གཙུག་ལག་ཁང་དུ་དོང་བ་དེའི་ཚེ་དགྲ་བཅོམ་པ་དེའི་ཐད་དུ་སོང་ནས་སྨྲས་པ།
en: “As the monks were all returning to the monastery after finishing their meals, he went to see the arhat and said,

source: བཙུན་པ་ཁྱོད་ཀྱིས་ཁྱིམ་བདག་འདི་ལྟར་བྱེད་པ་འདི་སུ་ཡིན་ཤེས་སམ།
en: ‘Lord, do you even know who this householder is?’

source: དགྲ་བཅོམ་པས་སྨྲས་པ། ངས་ཤེས་ཏེཕྱིར་མི་འོང་བ་ཡིན་ནོ། །
en: “ ‘I know he is a non-returner,’ replied the arhat.

source: ཞལ་ཏ་བྱེད་པས་སྨྲས་པ། གལ་ཏེ་དེ་ལྟར་ན་ཁྱོད་ཀྱིས་དེ་ལས་སྐྲ་བྲེགས་པ་ཉམས་སུ་བླངས་པ་བས་ནི། ཁྱོད་ཀྱི་སྐྲ་བཏོགས་ཀྱང་སླའོ། །
en: “ ‘Well if that’s the case,’ the steward monk said, ‘better that you would pluck out your own hair than for him to shave your head!

source: ཁྱོད་ཀྱིས་དེ་ལས་ཁྲུས་ཀྱི་ཡོ་བྱད་བླངས་པ་བས་ནི། ཁྱོད་ཕྱི་སའི་འདམ་དུ་བྱིང་ཡང་སླའོ། །
en: Better that you would sink in excrement than make off with his bathing implements!

source: ཁྱོད་ཀྱིས་དེ་ལས་ཟས་དང་སྐོམ་བླངས་པ་བས་ནི། ཁྱོད་ཀྱིས་ཕྱི་ས་དང་གཅིན་ཟོས་ཤིང་འཐུངས་ཀྱང་སླའོ་ཞེས་བྱས་སོ། །
en: Better that you would eat excrement and drink urine than take his food and drink!’

source: དེ་ནས་དགྲ་བཅོམ་པ་དེས་བསམས་པ་ཉོན་མོངས་པ་འདི་ནི་དམས་ཤིང་ཉམས་པར་གྱུར་ཏེ། གཏན་ཏུ་ཉམས་པར་གྱུར་ན་མི་རུང་གིས་འདིའི་ར་མདའ་བྱ་དགོས་སོ་སྙམ་ནས།
en: “Then the arhat thought, ‘It’s not right for this emotionally afflicted person, who has become so abased, to continue in this downward spiral. I have to help him.’

source: དེ་ལ་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཁྱོད་ཀྱིས་ང་སུ་ཡིན་པ་དང་ཁྱོད་བདག་སུ་ཡིན་པ་ཤེས་སམ།
en: With this thought, he said, ‘Venerable One, do you know who I am? And do you know who you yourself are?’

source: དེས་སྨྲས་པ། བདག་གིས་ཤེས་ཏེ་ཁྱོད་ཀྱང་རབ་ཏུ་བྱུང་བ་ཡིན་ང་ཡང་རབ་ཏུ་བྱུང་བ་ཡིན་ནོ། །
en: “ ‘I know that you have gone forth,’ he replied, ‘as have I.’

source: དགྲ་བཅོམ་པས་སྨྲས་པ། འོ་བུ་ཅག་རབ་ཏུ་བྱུང་བར་འདྲ་མོད་ཀྱི། ཁྱོད་ནི་སོ་སོའི་སྐྱེ་བོ་བཅིང་བ་ཐམས་ཅད་ཀྱིས་བཅིངས་པ་ཡིན་ཏེ། ང་ནི་དགྲ་བཅོམ་པ་བཅིང་བ་ཐམས་ཅད་ལས་གྲོལ་བ་ཡིན་ནོ། །
en: “ ‘Though we two are like brothers in having gone forth,’ the arhat said, ‘you are an ordinary person, bound by every fetter, and I am an arhat, liberated from every fetter.

source: ཁྱོད་ཀྱིས་ངག་རྩུབ་པོ་སྨྲས་ཀྱིས། ཉེས་པ་ལ་ཉེས་སོ་ཞེས་བཤགས་པར་གྱིས་ཤིག །
en: You must confess the mistake you’ve made by speaking harshly to me.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་དགེ་སློང་དེ་འགྱོད་པ་ཆེན་པོ་སྐྱེས་སོ། །དེ་འགྱོད་པ་སྐྱེས་ནས། དགྲ་བཅོམ་པ་དེའི་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་བཟོད་པ་གསོལ་ཏོ། །
en: “Hearing him, the monk was flooded with regret and bowed down at the feet of the arhat and asked his forgiveness.

source: ཀྱེ་མ་འདི་ལྟར་བདག་གིས་དགྲ་བཅོམ་པ་དེ་ལ་ཚིག་རྩུབ་སྨྲས་པའི་ལས་དེ་བདག་ལ་འོང་བར་མ་གྱུར་ཅིག །
en: ‘By this root of virtue, may I not meet with the results of the act of speaking harsh words to an arhat.

source: ཕྱིས་བདག་གིས་ཆོས་བཞིན་དུ་དགེ་འདུན་གྱི་ཞལ་ཏ་བྱས་པ་དང་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པའི་དགེ་བའི་རྩ་བ་འདིས་ན། བདག་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་གྱུར་ཅིག །
en: By the root of the virtue of later rendering service to the saṅgha in accord with the Dharma, and practicing pure conduct all my life, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: དེའི་ཚེ་དགེ་སློང་ཞལ་ཏ་བྱེད་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཝ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The monk who was the steward then is none other than Jackal.

source: དེས་དེར་དགྲ་བཅོམ་པ་དེ་ལ་ཚིག་རྩུབ་པོ་སྨྲས་ཏེ།
en: The act of speaking harshly to an arhat and telling him,

source: ཁྱོད་ཀྱིས་དེ་ལས་སྐྲ་བྲེགས་པ་ཉམས་སུ་བླངས་པ་བས་ནི། ཁྱོད་ཀྱི་སྐྲ་བཏོགས་ཀྱང་སླའོ་ཞེས་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི། གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་སྐྲ་བཏོགས་པར་གྱུར་ཏོ། །
en: ‘Better that you would pluck out your own hair than for him to shave your head!’ ripened such that wherever he was born, his hair was plucked out.

source: དེས་དེར་ཁྱོད་ཀྱིས་དེ་ལ་ཁྲུས་ཀྱི་ཡོ་བྱད་བླངས་པ་བས་ནི་ཁྱོད་ཕྱི་སའི་འདམ་དུ་བྱིང་ཡང་སླའོ་ཞེས་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི། གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱི་སའི་འདམ་དུ་གནས་པར་གྱུར་ཏོ། །
en: The act of telling him, ‘Better that you would sink in excrement than make off with his bathing implements!’ ripened such that wherever he was born, he lived in excrement.

source: དེས་དེར་དགྲ་བཅོམ་པ་དེ་ལ་ཁྱོད་ཀྱིས་དེ་ལས་ཟས་དང་སྐོམ་བླངས་པ་བས་ནི། ཁྱོད་ཀྱིས་ཕྱི་ས་དང་གཅིན་ཟོས་ཤིང་འཐུངས་ཀྱང་སླའོ་ཞེས་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི། གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ལུས་ལས་ཕྱི་སའི་དྲི་འབྱུང་བ་དང་ཕྱི་ས་ཟ་བར་གྱུར་ཏོ། །
en: The act of telling him, ‘Better that you would eat excrement and drink urine than take his food and drink!’ ripened such that wherever he was born, he ate excrement and drank urine.

source: དེས་དེར་ཆོས་བཞིན་དུ་ཞལ་ཏ་བྱས་པ་དང་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: The acts of serving as steward for the saṅgha in accord with the Dharma, practicing pure conduct all his life, and at the time of his death, praying,

source: གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བར་གྱུར་ཅིག་ཅེས་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི། གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེ
en: ‘Wherever I am born, may it be into a family of great means, prosperity, and wealth,’ ripened such that wherever he was born it was into a family of great means, prosperity, and wealth.

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: that he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.”

source: དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ།
en: “Lord,” the monks inquired,

source: བཙུན་པ་ཡི་དགས་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཡི་དགས་སུ་སྐྱེས་པར་གྱུར་ལགས།
en: “what action did the five hundred anguished spirits take that ripened into their births as anguished spirits?

source: ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ལྷར་སྐྱེས་ནས། དེ་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ཀྱང་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ལགས།
en: What actions did they take that ripened such that, once they took rebirth as gods, they also pleased the Blessed One, and did not displease him?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དེ་དག་ཉིད་ཀྱིས་ལས་དེ་ལྟ་བུ་བྱས་ཤིང་བསགས་ཏེ
en: “Monks,” the Blessed One explained, “such are the actions that they committed and accumulated:

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ། སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ་སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེའི་གསུང་རབ་ལ་འདི་དག་ཐམས་ཅད་དགེ་བསྙེན་དུ་གྱུར་ནས།
en: “Monks, in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha endowed with perfect knowledge and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world, they all became lay vow holders.

source: དེ་དག་གི་ཐད་དུ་དགེ་སློང་རྣམས་འགྲོ་ཞིང་། གོས་དང་ཟས་དང་མལ་ཆ་དང་སྟན་དང་ནད་གསོས་དང་སྨན་ཟོང་ཡང་དང་ཡང་དུ་སློང་ནས་དེ་དག་སེར་སྣའི་དབང་དུ་གྱུར་ཏེ
en: When the monks came asking them for provisions of clothing, food, bedding, seats, and medicines for the sick, overcome with stinginess they said,

source: དགེ་སློང་དེ་དག་ལ་འོད་སྲུང་གི་དགེ་སྦྱོང་འདི་དག་ནི་ཡི་དགས་བཞིན་དུ་ཁོར་ཟུག་ཏུ་གཞན་ལ་རེ་བ་ལྷུར་བྱེད་ཅིང་རྒྱུའོ་ཞེས་དེ་ལྟ་བུའི་ཚིག་རྩུབ་པོ་སྨྲས་སོ། །
en: ‘Kāśyapa’s ascetics are just like anguished spirits, going around begging food from others!’ and called after them with other such harsh words.

source: དེའི་ཚེ་དགེ་བསྙེན་ལྔ་བརྒྱར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི་ཡི་དགས་ལྔ་བརྒྱ་པོ་དེ་དག་ཁོ་ན་ཡིན་ཏེ།
en: Those who were the five hundred lay vow holders then are none other than these five hundred anguished spirits.

source: དེ་དག་གིས་དེར་དགེ་སློང་དེ་དག་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་ཚེ་རབས་ལྔ་བརྒྱར་ཡི་དགས་སུ་སྐྱེས་སོ། །
en: The act of speaking harshly to the monks ripened into their taking birth as anguished spirits for five hundred lifetimes.

source: དེ་དག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་།
en: At that time they went for refuge in the doctrine of the totally and completely awakened Buddha Kāśyapa.

source: བསླབ་པའི་གཞི་རྣམས་བསྲུངས་ཏེ་དབང་པོ་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ནི་དེ་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ། །
en: They maintained the fundamental precepts, their faculties ripened, and now they have been liberated.”

source: ལས་བརྒྱ་ཐམ་པ་ལས་སྡོམ་གྱི་ཚིགས་སུ་བཅད་པ་ལྔ་པ་རྫོགས་སྷོ།། །།
en: This concludes Part Five of The Hundred Deeds.

source: སྡོམ་ནི། བྱ་གཉིས་དང་ནི་ལུས་འཕགས་དང་།
en: 1. The Bird: Two Stories 2. The Story of Majestic Body

source: སྟོན་པ་འོད་སྲུང་ཀུན་དགའ་བོ། །
en: 3. The Teacher 4. A Story about Kāśyapa 5. A Story about Ānanda

source: འཛིན་བྱེད་བུ་དང་རབ་བཟང་དང་།
en: 6. The Story of Son of Grasping 7. The Story of Subhadra the Mendicant

source: ཡོན་རབས་དང་ནི་རྒན་ཞུགས་གཉིས། །
en: 8. The Worthy of Offerings Litany 9. Latecomers: Two Stories

source: བྱ་གཉིས་ཞེས་བྱ་བ་ལ།
en: The Bird: Two Stories

source: བྱ་དང་པོ་ནི།
en: The First Bird Story

source: གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེདེའི་ཚེ་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་བཞུགས་ཏེ། དེ་ན་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་ཕྲག་དུ་མའི་གུང་ལ་བཞུགས་ཤིང་ཆོས་སྟོན་པའི་སྐབས་སུ་རི་སྤོས་ཀྱི་ངད་ལྡང་ནས། རྨ་བྱ་བལྟ་ན་སྡུག་ཅེས་བྱ་བ་ཞིག་འོངས་ནས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་གྱི་སྟེང་གི་བར་སྣང་ལ་ལྡིང་བ་ལས། བྱ་དེས་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་ཕྲག་དུ་མའི་གུང་ལ་བཞུགས་ཤིང་ཆོས་སྟོན་པ་ཐོས་སོ། །
en: Once, when the Blessed One was staying at Vulture Peak Mountain in Rājagṛha teaching the Dharma amid a company of hundreds, from Gandhamādana Mountain a certain peacock named Beautiful to See came gliding through the sky over the garden of Prince Jeta. The bird overheard the Blessed One teaching the Dharma as he sat amid the company of hundreds,
